Repository: carlosgutierrezlopez/Simula3MS-Swift
Catalog: Localizable.xcstrings
Source language: en
Languages: ar, br, cs, cy, da, de, el, es, et, fa, fi, fr, ga, gd, gl, he, hi, hr, it, ja, ko, kw, lt, lv, nb, nl, pl, pt_pt, ro, sv, uk, zh_hans

# sim.generalRegisters
source: General registers
ar: السجلات العامة
br: Marilhioù hollek
cs: Obecné registry
cy: Cofrestrau cyffredinol
da: Generelle registre
de: Allgemeine Register
el: Γενικοί καταχωρητές
es: Registros generales
et: Üldregistrid
fa: ثبات‌های عمومی
fi: Yleisrekisterit
fr: Registres généraux
ga: Cláir ghinearálta
gd: Clàran coitcheann
gl: Rexistros xerais
he: אוגרים כלליים
hi: सामान्य रजिस्टर
hr: Opći registri
it: Registri generali
ja: 汎用レジスタ
ko: 일반 레지스터
kw: Kovradow ollgemmyn
lt: Bendrieji registrai
lv: Vispārējie reģistri
nb: Generelle registre
nl: Algemene registers
pl: Rejestry ogólne
pt_pt: Registos gerais
ro: Registre generale
sv: Allmänna register
uk: Загальні регістри
zh_hans: 通用寄存器

# sim.instructionShort
source: Instr
ar: تع
br: Urz
cy: Cyf
el: Εντ
fa: دست
ga: Treo
gd: Stiù
he: פק'
hi: निर्द
ja: 命令
ko: 명령
kw: Gorh
uk: Інстр
zh_hans: 指令

# sim.mapMissing
source: Map not available in assets
ar: الخريطة غير متوفرة في الموارد
br: N’eo ket hegerz ar gartenn e-touez an assets
cs: Mapa není v prostředcích k dispozici
cy: Nid yw’r map ar gael yn yr asedau
da: Kort ikke tilgængeligt i assets
de: Karte in den Assets nicht verfügbar
el: Ο χάρτης δεν είναι διαθέσιμος στα assets
es: Mapa no disponible en assets
et: Kaart pole varades saadaval
fa: نقشه در منابع موجود نیست
fi: Karttaa ei ole saatavilla resursseissa
fr: Carte non disponible dans les ressources
ga: Níl an léarscáil ar fáil sna hacmhainní
gd: Chan eil am mapa ri fhaighinn anns na goireasan
gl: Mapa non dispoñible en assets
he: המפה אינה זמינה במשאבים
hi: एसेट्स में मानचित्र उपलब्ध नहीं है
hr: Karta nije dostupna u resursima
it: Mappa non disponibile nelle risorse
ja: アセットにマップがありません
ko: 에셋에 맵이 없습니다
kw: Nyns yw an mappa kavadow yn an assets
lt: Žemėlapio nėra ištekliuose
lv: Karte nav pieejama resursos
nb: Kart ikke tilgjengelig i ressurser
nl: Kaart niet beschikbaar in assets
pl: Mapa niedostępna w zasobach
pt_pt: Mapa indisponível nos recursos
ro: Harta nu este disponibilă în resurse
sv: Karta inte tillgänglig i tillgångar
uk: Карта недоступна в ресурсах
zh_hans: 资源中没有可用映射

# sim.noCycleSelected
source: No cycle selected.
ar: لم يتم تحديد دورة.
br: N’eus tro dibabet ebet.
cs: Není vybrán žádný cyklus.
cy: Nid oes cylch wedi’i ddewis.
da: Ingen cyklus valgt.
de: Kein Zyklus ausgewählt.
el: Δεν έχει επιλεγεί κύκλος.
es: Sin ciclo seleccionado.
et: Tsüklit pole valitud.
fa: هیچ چرخه‌ای انتخاب نشده است.
fi: Sykliä ei ole valittu.
fr: Aucun cycle sélectionné.
ga: Níor roghnaíodh timthriall ar bith.
gd: Cha deach cearcall a thaghadh.
gl: Sen ciclo seleccionado.
he: לא נבחר מחזור.
hi: कोई चक्र चयनित नहीं है।
hr: Nije odabran nijedan ciklus.
it: Nessun ciclo selezionato.
ja: サイクルが選択されていません。
ko: 선택된 사이클이 없습니다.
kw: Nyns eus kelgh dewisys.
lt: Nepasirinktas joks ciklas.
lv: Nav izvēlēts cikls.
nb: Ingen syklus valgt.
nl: Geen cyclus geselecteerd.
pl: Nie wybrano cyklu.
pt_pt: Nenhum ciclo selecionado.
ro: Niciun ciclu selectat.
sv: Ingen cykel vald.
uk: Цикл не вибрано.
zh_hans: 未选择周期。

# sim.noCycleShort
source: No cycle
ar: لا توجد دورة
br: Tro ebet
cs: Žádný cyklus
cy: Dim cylch
da: Ingen cyklus
de: Kein Zyklus
el: Χωρίς κύκλο
es: Sin ciclo
et: Tsükkel puudub
fa: بدون چرخه
fi: Ei sykliä
fr: Aucun cycle
ga: Gan timthriall
gd: Gun chearcall
gl: Sen ciclo
he: אין מחזור
hi: कोई चक्र नहीं
hr: Nema ciklusa
it: Nessun ciclo
ja: サイクルなし
ko: 사이클 없음
kw: Nag eus kelgh
lt: Nėra ciklo
lv: Nav cikla
nb: Ingen syklus
nl: Geen cyclus
pl: Brak cyklu
pt_pt: Sem ciclo
ro: Fără ciclu
sv: Ingen cykel
uk: Немає циклу
zh_hans: 无周期

# sim.noExecutionYet
source: No execution yet.
ar: لا يوجد تنفيذ بعد.
br: Seveniñ ebet c’hoazh.
cs: Zatím žádné spuštění.
cy: Dim gweithrediad eto.
da: Ingen kørsel endnu.
de: Noch keine Ausführung.
el: Δεν υπάρχει ακόμη εκτέλεση.
es: Sin ejecución todavía.
et: Täitmisi veel pole.
fa: هنوز اجرایی انجام نشده است.
fi: Suoritusta ei vielä ole.
fr: Aucune exécution pour le moment.
ga: Níl aon rith fós.
gd: Chan eil ruith ann fhathast.
gl: Sen execución aínda.
he: עדיין אין הרצה.
hi: अभी तक कोई चालन नहीं हुआ।
hr: Još nema izvođenja.
it: Nessuna esecuzione ancora.
ja: まだ実行されていません。
ko: 아직 실행되지 않았습니다.
kw: Nyns eus resya hwath.
lt: Vykdymo dar nėra.
lv: Izpildes vēl nav.
nb: Ingen kjøring ennå.
nl: Nog geen uitvoering.
pl: Brak wykonania.
pt_pt: Ainda não há execução.
ro: Încă nu există execuție.
sv: Ingen körning ännu.
uk: Виконання ще не було.
zh_hans: 尚未执行。

# sim.noInstructions
source: No instructions.
ar: لا توجد تعليمات.
br: Urzhioù ebet.
cs: Žádné instrukce.
cy: Dim cyfarwyddiadau.
da: Ingen instruktioner.
de: Keine Anweisungen.
el: Δεν υπάρχουν εντολές.
es: Sin instrucciones.
et: Juhiseid pole.
fa: دستوری وجود ندارد.
fi: Ei ohjeita.
fr: Aucune instruction.
ga: Níl aon treoracha ann.
gd: Chan eil stiùiridhean ann.
gl: Sen instrucións.
he: אין פקודות.
hi: कोई निर्देश नहीं हैं।
hr: Nema instrukcija.
it: Nessuna istruzione.
ja: 命令がありません。
ko: 명령어가 없습니다.
kw: Nyns eus gorhemmyn.
lt: Nėra instrukcijų.
lv: Nav instrukciju.
nb: Ingen instruksjoner.
nl: Geen instructies.
pl: Brak instrukcji.
pt_pt: Sem instruções.
ro: Nu există instrucțiuni.
sv: Inga instruktioner.
uk: Немає інструкцій.
zh_hans: 没有指令。

# sim.noMemoryData
source: No memory data.
ar: لا توجد بيانات في الذاكرة.
br: Roadennoù memor ebet.
cs: Žádná data paměti.
cy: Dim data cof.
da: Ingen hukommelsesdata.
de: Keine Speicherdaten.
el: Δεν υπάρχουν δεδομένα μνήμης.
es: Sin datos de memoria.
et: Mälus andmeid pole.
fa: داده‌ای در حافظه وجود ندارد.
fi: Ei muistidataa.
fr: Aucune donnée mémoire.
ga: Níl aon sonraí cuimhne ann.
gd: Chan eil dàta cuimhne ann.
gl: Sen datos de memoria.
he: אין נתוני זיכרון.
hi: कोई मेमोरी डेटा नहीं है।
hr: Nema podataka u memoriji.
it: Nessun dato di memoria.
ja: メモリデータがありません。
ko: 메모리 데이터가 없습니다.
kw: Nyns eus data cof.
lt: Nėra atminties duomenų.
lv: Nav atmiņas datu.
nb: Ingen minnedata.
nl: Geen geheugengegevens.
pl: Brak danych pamięci.
pt_pt: Sem dados de memória.
ro: Nu există date de memorie.
sv: Inga minnesdata.
uk: Немає даних пам’яті.
zh_hans: 没有内存数据。

# sim.registers
source: Registers
ar: السجلات
br: Marilhioù
cs: Registry
cy: Cofrestrau
da: Registre
de: Register
el: Καταχωρητές
es: Registros
et: Registrid
fa: ثبات‌ها
fi: Rekisterit
fr: Registres
ga: Cláir
gd: Clàran
gl: Rexistros
he: אוגרים
hi: रजिस्टर
hr: Registri
it: Registri
ja: レジスタ
ko: 레지스터
kw: Kovradow
lt: Registrai
lv: Reģistri
nb: Registere
pl: Rejestry
pt_pt: Registos
ro: Registre
sv: Register
uk: Регістри
zh_hans: 寄存器

# sim.stepNext
source: Next step
ar: الخطوة التالية
br: Pazenn da-heul
cs: Další krok
cy: Cam nesaf
da: Næste trin
de: Nächster Schritt
el: Επόμενο βήμα
es: Paso siguiente
et: Järgmine samm
fa: گام بعدی
fi: Seuraava vaihe
fr: Étape suivante
ga: An chéad chéim eile
gd: An ath cheum
gl: Paso seguinte
he: צעד הבא
hi: अगला चरण
hr: Sljedeći korak
it: Passo successivo
ja: 次のステップ
ko: 다음 단계
kw: Kamm nessa
lt: Kitas žingsnis
lv: Nākamais solis
nb: Neste steg
nl: Volgende stap
pl: Następny krok
pt_pt: Passo seguinte
ro: Pasul următor
sv: Nästa steg
uk: Наступний крок
zh_hans: 下一步

# sim.stepPrev
source: Previous step
ar: الخطوة السابقة
br: Pazenn gent
cs: Předchozí krok
cy: Cam blaenorol
da: Forrige trin
de: Vorheriger Schritt
el: Προηγούμενο βήμα
es: Paso anterior
et: Eelmine samm
fa: گام قبلی
fi: Edellinen vaihe
fr: Étape précédente
ga: An chéim roimhe seo
gd: An ceum roimhe
gl: Paso anterior
he: צעד קודם
hi: पिछला चरण
hr: Prethodni korak
it: Passo precedente
ja: 前のステップ
ko: 이전 단계
kw: Kamm kynsa
lt: Ankstesnis žingsnis
lv: Iepriekšējais solis
nb: Forrige steg
nl: Vorige stap
pl: Poprzedni krok
pt_pt: Passo anterior
ro: Pasul anterior
sv: Föregående steg
uk: Попередній крок
zh_hans: 上一步

# sim.textSegment
source: Text segment
ar: مقطع النص
br: Kevrenn testenn
cs: Textový segment
cy: Segment testun
da: Tekstsegment
el: Τμήμα κειμένου
es: Segmento de texto
et: Tekstisegment
fa: بخش متن
fi: Tekstisegmentti
fr: Segment de texte
ga: Deighleog téacs
gd: Earrann teacsa
gl: Segmento de texto
he: מקטע טקסט
hi: पाठ खंड
hr: Tekstualni segment
it: Segmento testo
ja: テキストセグメント
ko: 텍스트 세그먼트
kw: Rann tekst
lt: Teksto segmentas
lv: Teksta segments
nb: Tekstsegment
nl: Tekstsegment
pl: Segment tekstu
pt_pt: Segmento de texto
ro: Segment de text
uk: Текстовий сегмент
zh_hans: 文本段

# status.assembledOk
source: Assembled successfully
ar: تم التجميع بنجاح
br: Aoziet mat
cs: Sestavení proběhlo úspěšně
cy: Cydosodwyd yn llwyddiannus
da: Assemblering gennemført
de: Erfolgreich assembliert
el: Η συναρμολόγηση ολοκληρώθηκε επιτυχώς
es: Ensamblado correcto
et: Assembleerimine õnnestus
fa: اسمبل با موفقیت انجام شد
fi: Käännös onnistui
fr: Assemblage réussi
ga: D’éirigh leis an tionól
gd: Chaidh a chruinneachadh gu soirbheachail
gl: Ensamblado correcto
he: האסמבל הושלם בהצלחה
hi: असेंबल सफल रहा
hr: Sastavljanje je uspjelo
it: Assemblaggio completato correttamente
ja: アセンブル成功
ko: 어셈블 성공
kw: Kuntellys yn lowr
lt: Asamblinimas pavyko
lv: Asemblēšana izdevās
nb: Assemblering fullført
nl: Assembleren geslaagd
pl: Asemblacja zakończona powodzeniem
pt_pt: Montagem concluída com sucesso
ro: Asamblare reușită
sv: Assemblering lyckades
uk: Збирання успішне
zh_hans: 汇编成功

# status.dataVars
source: .data variables
ar: متغيرات .data
br: Argemmoù .data
cs: Proměnné .data
cy: Newidynnau .data
da: .data-variabler
de: .data-Variablen
el: Μεταβλητές .data
es: Variables .data
et: .data muutujad
fa: متغیرهای .data
fi: .data-muuttujat
fr: Variables .data
ga: Athróga .data
gd: Caochladairean .data
gl: Variables .data
he: משתני .data
hi: .data चर
hr: .data varijable
it: Variabili .data
ja: .data 変数
ko: .data 변수
kw: Variablow .data
lt: .data kintamieji
lv: .data mainīgie
nb: .data-variabler
nl: .data-variabelen
pl: Zmienne .data
pt_pt: Variáveis .data
ro: Variabile .data
sv: .data-variabler
uk: Змінні .data
zh_hans: .data 变量

# status.emptyFile
source: Line 1: The file is empty
ar: السطر 1: الملف فارغ
br: Linenn 1: goullo eo ar restr
cs: Řádek 1: Soubor je prázdný
cy: Llinell 1: Mae’r ffeil yn wag
da: Linje 1: filen er tom
de: Zeile 1: Die Datei ist leer
el: Γραμμή 1: Το αρχείο είναι κενό
es: Línea 1: El archivo está vacío
et: Rida 1: fail on tühi
fa: خط ۱: فایل خالی است
fi: Rivi 1: tiedosto on tyhjä
fr: Ligne 1 : le fichier est vide
ga: Líne 1: Tá an comhad folamh
gd: Loidhne 1: Tha am faidhle falamh
gl: Liña 1: O ficheiro está baleiro
he: שורה 1: הקובץ ריק
hi: पंक्ति 1: फ़ाइल खाली है
hr: Redak 1: datoteka je prazna
it: Riga 1: il file è vuoto
ja: 1 行目: ファイルは空です
ko: 1행: 파일이 비어 있습니다
kw: Linenn 1: gwag yw an restren
lt: 1 eilutė: failas tuščias
lv: 1. rinda: fails ir tukšs
nb: Linje 1: filen er tom
nl: Regel 1: het bestand is leeg
pl: Wiersz 1: plik jest pusty
pt_pt: Linha 1: o ficheiro está vazio
ro: Linia 1: fișierul este gol
sv: Rad 1: filen är tom
uk: Рядок 1: файл порожній
zh_hans: 第 1 行：文件为空

# status.instructions
source: Instructions
ar: التعليمات
br: Urzhioù
cs: Instrukce
cy: Cyfarwyddiadau
da: Instruktioner
de: Anweisungen
el: Εντολές
es: Instrucciones
et: Juhised
fa: دستورها
fi: Ohjeet
ga: Treoracha
gd: Stiùiridhean
gl: Instrucións
he: פקודות
hi: निर्देश
hr: Instrukcije
it: Istruzioni
ja: 命令
ko: 명령어
kw: Gorhemmyn
lt: Instrukcijos
lv: Instrukcijas
nb: Instruksjoner
nl: Instructies
pl: Instrukcje
pt_pt: Instruções
ro: Instrucțiuni
sv: Instruktioner
uk: Інструкції
zh_hans: 指令

# status.linePrefix
source: Line
ar: السطر
br: Linenn
cs: Řádek
cy: Llinell
da: Linje
de: Zeile
el: Γραμμή
es: Línea
et: Rida
fa: خط
fi: Rivi
fr: Ligne
ga: Líne
gd: Loidhne
gl: Liña
he: שורה
hi: पंक्ति
hr: Redak
it: Riga
ja: 行
ko: 행
kw: Linenn
lt: Eilutė
lv: Rinda
nb: Linje
nl: Regel
pl: Wiersz
pt_pt: Linha
ro: Linia
sv: Rad
uk: Рядок
zh_hans: 行

# alert.restartRecommended.partialMenuBarWarning
source: Some macOS menu bar items may not be completely translated for this language.
br: Marteze ne vo ket troet penn-da-benn lod elfennoù eus barrenn lañserioù macOS evit ar yezh-mañ.
cy: Efallai na fydd rhai eitemau ym mar dewislenni macOS wedi'u cyfieithu'n llawn ar gyfer yr iaith hon.
et: Mõned macOS-i menüüriba elemendid ei pruugi selles keeles olla täielikult tõlgitud.
fa: ممکن است برخی از موارد نوار منوی macOS برای این زبان به‌طور کامل ترجمه نشده باشند.
ga: Seans nach bhfuil roinnt míreanna i mbarra roghchláir macOS aistrithe go hiomlán don teanga seo.
gd: Dh'fhaodadh nach eil cuid de nithean bàr-chlàr macOS air an eadar-theangachadh gu tur dhan chànan seo.
gl: Algúns elementos da barra de menús de macOS poden non estar completamente traducidos para este idioma.
kw: Yma lies tra a var dewislen macOS na allsa bos treylys yn tien rag an yeth ma.
lt: Kai kurie macOS meniu juostos elementai šia kalba gali būti išversti ne iki galo.
lv: Daži macOS izvēļņu joslas elementi šajā valodā var nebūt pilnībā iztulkoti.
